{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "input_5", "class_name": "InputLayer", "config": {"batch_input_shape": [1, 4096], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_5"}, "inbound_nodes": []}, {"name": "reshape_4", "class_name": "Reshape", "config": {"name": "reshape_4", "trainable": true, "dtype": "float32", "target_shape": [64, 64, 1]}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "depthwise_conv2d_21", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_21", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": 0, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 32, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.909295109849609e-09}}, "depthwise_constraint": null}, "inbound_nodes": [[["reshape_4", 0, 0, {}]]]}, {"name": "average_pooling2d_12", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_12", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["reshape_4", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["depthwise_conv2d_21", 0, 0, {}]]]}, {"name": "depthwise_conv2d_20", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_20", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": 0, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 32, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["average_pooling2d_12", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["activation_10", 0, 0, {}], ["depthwise_conv2d_20", 0, 0, {}]]]}, {"name": "depthwise_conv2d_23", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_23", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": 0, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.909295109849609e-09}}, "depthwise_constraint": null}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "average_pooling2d_13", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_13", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["depthwise_conv2d_23", 0, 0, {}]]]}, {"name": "depthwise_conv2d_22", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_22", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": 0, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["average_pooling2d_13", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["activation_11", 0, 0, {}], ["depthwise_conv2d_22", 0, 0, {}]]]}, {"name": "depthwise_conv2d_25", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_25", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": 0, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.909295109849609e-09}}, "depthwise_constraint": null}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "average_pooling2d_14", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_14", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["depthwise_conv2d_25", 0, 0, {}]]]}, {"name": "depthwise_conv2d_24", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_24", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": 0, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["average_pooling2d_14", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["activation_12", 0, 0, {}], ["depthwise_conv2d_24", 0, 0, {}]]]}, {"name": "depthwise_conv2d_27", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_27", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": 0, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 3.909295109849609e-09}}, "depthwise_constraint": null}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "average_pooling2d_15", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_15", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["depthwise_conv2d_27", 0, 0, {}]]]}, {"name": "depthwise_conv2d_26", "class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_26", "trainable": true, "dtype": "float32", "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": 0, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 2, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["average_pooling2d_15", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["activation_13", 0, 0, {}], ["depthwise_conv2d_26", 0, 0, {}]]]}, {"name": "flatten_4", "class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 212, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 1.9546476437426463e-07}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_4", 0, 0, {}]]]}, {"name": "regression_part", "class_name": "Dense", "config": {"name": "regression_part", "trainable": true, "dtype": "float32", "units": 8192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 1.9546476437426463e-07}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}], "input_layers": [["input_5", 0, 0]], "output_layers": [["regression_part", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "dense_4/kernel", "shape": [4096, 212], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [212], "dtype": "float32"}, {"name": "depthwise_conv2d_20/depthwise_kernel", "shape": [1, 1, 1, 32], "dtype": "float32"}, {"name": "depthwise_conv2d_21/depthwise_kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "depthwise_conv2d_22/depthwise_kernel", "shape": [1, 1, 32, 2], "dtype": "float32"}, {"name": "depthwise_conv2d_23/depthwise_kernel", "shape": [3, 3, 32, 2], "dtype": "float32"}, {"name": "depthwise_conv2d_24/depthwise_kernel", "shape": [1, 1, 64, 2], "dtype": "float32"}, {"name": "depthwise_conv2d_25/depthwise_kernel", "shape": [3, 3, 64, 2], "dtype": "float32"}, {"name": "depthwise_conv2d_26/depthwise_kernel", "shape": [1, 1, 128, 2], "dtype": "float32"}, {"name": "depthwise_conv2d_27/depthwise_kernel", "shape": [3, 3, 128, 2], "dtype": "float32"}, {"name": "regression_part_4/kernel", "shape": [212, 8192], "dtype": "float32"}, {"name": "regression_part_4/bias", "shape": [8192], "dtype": "float32"}]}]}